open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsg_test.c
/****************************************************************************
 * chips/bk7258/common/
 * bk7258_rpmsg_test.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Board-local N9 AP-SMP RPMsg concurrency and latency test service.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_RPMSG_TEST

#include <errno.h>
#ifdef CONFIG_BK7258_AP_CORE
#  include <malloc.h>
#endif
#include <pthread.h>
#include <sched.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>

#include <driver/aon_rtc.h>
#include <soc/reg_base.h>

#include <arch/chip/bk7258_amp.h>
#include <arch/chip/bk7258_rptun.h>

#include "bk7258_rptun.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_RPMSG_TEST_EPT_NAME       "bk7258-smp-test"
#define BK7258_RPMSG_TEST_WIRE_MAGIC     0x54505242u /* "BRPT" */
#define BK7258_RPMSG_TEST_WIRE_VERSION   1u
#define BK7258_RPMSG_TEST_SEND_TIMEOUT   100u
#define BK7258_RPMSG_TEST_REPLY_TIMEOUT  1000u
#define BK7258_RPMSG_TEST_REPORT_MARGIN  2000u
#define BK7258_RPMSG_TEST_CLEANUP_TIMEOUT 1000u
#define BK7258_RPMSG_TEST_MIN_TIMEOUT    1000u
#define BK7258_RPMSG_TEST_MAX_TIMEOUT    60000u
#define BK7258_RPMSG_TEST_CONTROLLER_PRIO 110
#define BK7258_RPMSG_TEST_WORKER_PRIO    120
#define BK7258_RPMSG_TEST_LOAD_PRIO      80
#define BK7258_RPMSG_TEST_TX_PRIO        190
#define BK7258_RPMSG_TEST_TX_POLL_MS     1u
#define BK7258_RPMSG_TEST_DONE_POLL_MS   1u
#define BK7258_RPMSG_TEST_THREAD_STACK   4096
#define BK7258_RPMSG_TEST_AON_COUNT_LOW  (SOC_AON_RTC_REG_BASE + 3u * 4u)

#ifdef CONFIG_BK7258_AP_CORE
#  define BK7258_RPMSG_TEST_REMOTE_NAME  "cp"
#else
#  define BK7258_RPMSG_TEST_REMOTE_NAME  "ap"
#endif

enum bk7258_rpmsg_test_command_e
{
  BK7258_RPMSG_TEST_COMMAND_START = 1,
  BK7258_RPMSG_TEST_COMMAND_ECHO,
  BK7258_RPMSG_TEST_COMMAND_ECHO_RESPONSE,
  BK7258_RPMSG_TEST_COMMAND_REPORT
};

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_rpmsg_test_wire_s
{
  uint32_t magic;
  uint16_t version;
  uint16_t command;
  uint32_t generation;
  uint32_t run_id;
  uint32_t sequence;
  uint32_t slot;
  uint32_t payload_size;
  uint32_t value;
  uint8_t data[BK7258_RPMSG_TEST_MAX_PAYLOAD];
};

#ifdef CONFIG_BK7258_AP_CORE
struct bk7258_rpmsg_test_tx_request_s
{
  uint8_t data[BK7258_RPMSG_TEST_FRAME_SIZE];
  size_t len;
  uint32_t timeout_ms;
  volatile int status;
};
#endif

struct bk7258_rpmsg_test_dev_s
{
  struct rpmsg_endpoint ept;
  volatile bool initialized;
  volatile bool endpoint_created;
  volatile int connection_error;

#ifdef CONFIG_BK7258_AP_CORE
  sem_t start_sem;
  sem_t done_sem;
  sem_t worker_start_sem[2];
  sem_t reply_sem[2];
  sem_t load_start_sem;
  sem_t load_done_sem;
  sem_t tx_sem;
  sem_t tx_done_sem[2];
  volatile bool shutdown;
  volatile uint32_t tx_pending;
  volatile uint32_t worker_dispatch[2];
  struct bk7258_rpmsg_test_tx_request_s tx_request[2];
  volatile bool busy;
  volatile bool abort;
  volatile bool load_stop;
  volatile uint32_t generation;
  volatile uint32_t run_id;
  volatile uint32_t count;
  volatile uint32_t payload_size;
  volatile uint32_t flags;
  volatile uint32_t timeout_ms;
  volatile uint32_t awaiting[2];
  volatile int reply_status[2];
  volatile int worker_status[2];
  volatile uint32_t workers_done;
  uint32_t latency[2][BK7258_RPMSG_TEST_MAX_COUNT];
  struct bk7258_rpmsg_test_result_s result;
#else
  sem_t report_sem;
  volatile uint32_t waiting_generation;
  volatile uint32_t waiting_run_id;
  volatile bool report_valid;
  struct bk7258_rpmsg_test_result_s report;
#endif
};

/****************************************************************************
 * Compile-time ABI Gates
 ****************************************************************************/

static_assert(offsetof(struct bk7258_rpmsg_test_wire_s, data) ==
              BK7258_RPMSG_TEST_WIRE_HEADER_SIZE,
              "BK7258 RPMsg test wire header changed");
static_assert(sizeof(struct bk7258_rpmsg_test_wire_s) ==
              BK7258_RPMSG_TEST_FRAME_SIZE,
              "BK7258 RPMsg test wire frame changed");

#if defined(CONFIG_BK7258_AP_CORE) && \
    defined(CONFIG_BK7258_AP_SUPERVISOR)
/* The test gateway must not suppress the N10 primary management heartbeat.
 * Transport workers still own priorities 224/225, followed by the N10
 * heartbeat at its default 200, then this board-only traffic generator.
 */

static_assert(BK7258_RPMSG_TEST_TX_PRIO <
              CONFIG_BK7258_AP_SUPERVISOR_PRIORITY,
              "RPMsg test TX must remain below the AP heartbeat");
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct bk7258_rpmsg_test_dev_s g_bk7258_rpmsg_test;

#ifndef CONFIG_BK7258_AP_CORE
static mutex_t g_bk7258_rpmsg_test_lock = NXMUTEX_INITIALIZER;
static uint32_t g_bk7258_rpmsg_test_next_run;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void bk7258_rpmsg_test_flush_sem(sem_t *sem)
{
  while (nxsem_trywait(sem) == OK)
    {
    }
}

static int bk7258_rpmsg_test_sem_init(sem_t *sem)
{
  int ret;

  ret = nxsem_init(sem, 0, 0);
#ifdef CONFIG_PRIORITY_INHERITANCE
  if (ret >= 0)
    {
      ret = nxsem_set_protocol(sem, SEM_PRIO_NONE);
    }
#endif

  return ret;
}

#ifdef CONFIG_BK7258_AP_CORE
static void bk7258_rpmsg_test_reset_runtime(
  FAR struct bk7258_rpmsg_test_dev_s *priv)
{
  unsigned int i;

  /* initialize() is retryable after any staged setup failure.  Reset every
   * control word consumed by a permanent worker before creating the first
   * one; otherwise abort/load_stop from the failed attempt makes the next
   * worker set exit immediately even though all semaphore ownership was
   * correctly rebuilt.
   */

  __atomic_store_n(&priv->shutdown, false, __ATOMIC_RELEASE);
  __atomic_store_n(&priv->tx_pending, 0, __ATOMIC_RELEASE);
  __atomic_store_n(&priv->busy, false, __ATOMIC_RELEASE);
  __atomic_store_n(&priv->abort, false, __ATOMIC_RELEASE);
  __atomic_store_n(&priv->load_stop, false, __ATOMIC_RELEASE);
  __atomic_store_n(&priv->workers_done, 0, __ATOMIC_RELEASE);

  for (i = 0; i < 2; i++)
    {
      __atomic_store_n(&priv->worker_dispatch[i], 0, __ATOMIC_RELEASE);
      __atomic_store_n(&priv->awaiting[i], 0, __ATOMIC_RELEASE);
      __atomic_store_n(&priv->reply_status[i], -EINPROGRESS,
                       __ATOMIC_RELEASE);
      __atomic_store_n(&priv->worker_status[i], -EINPROGRESS,
                       __ATOMIC_RELEASE);
      __atomic_store_n(&priv->tx_request[i].status, -EINPROGRESS,
                       __ATOMIC_RELEASE);
      priv->tx_request[i].len = 0;
      priv->tx_request[i].timeout_ms = 0;
    }

  priv->generation = 0;
  priv->run_id = 0;
  priv->count = 0;
  priv->payload_size = 0;
  priv->flags = 0;
  priv->timeout_ms = 0;
  memset(priv->latency, 0, sizeof(priv->latency));
  memset(&priv->result, 0, sizeof(priv->result));
}
#endif

static bool bk7258_rpmsg_test_endpoint_ready(void)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  return __atomic_load_n(&priv->endpoint_created, __ATOMIC_ACQUIRE) &&
         control->magic == BK7258_RPTUN_CONTROL_MAGIC &&
         control->version == BK7258_RPTUN_CONTROL_VERSION &&
         control->size == sizeof(*control) &&
         control->generation != 0 &&
         control->state == BK7258_RPTUN_STATE_CONNECTED &&
         is_rpmsg_ept_ready(&priv->ept);
}

