open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsg_test.c
static uint32_t bk7258_rpmsg_test_aon_tick(void)
{
  /* The SDK's 64-bit getter loops until two low/high register pairs match.
   * CPU2 can observe a new 32 kHz low word between every pair and remain in
   * that loop.  A single low-word sample is sufficient for the bounded N9
   * test window (at most 60 seconds, versus roughly 37 hours to wrap).
   */

  return *(volatile uint32_t *)(uintptr_t)
           BK7258_RPMSG_TEST_AON_COUNT_LOW;
}

static int bk7258_rpmsg_test_send_bounded(const void *data, size_t len,
                                           uint32_t timeout_ms)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  uint32_t frequency = bk_rtc_get_clock_freq();
  uint32_t start = bk7258_rpmsg_test_aon_tick();
  uint32_t timeout_ticks =
    (uint32_t)(((uint64_t)timeout_ms * frequency + 999u) / 1000u);
  int ret = -ENOTCONN;

  do
    {
      if (!bk7258_rpmsg_test_endpoint_ready())
        {
          return -ENOTCONN;
        }

      /* OpenAMP serializes TX buffer allocation and virtqueue enqueue with
       * the rpmsg_device lock.  AP producers reach this call only through
       * the CPU0 TX gateway; direct AP calls are likewise CPU0-only.  Do not
       * add another board lock here because it would nest around OpenAMP's
       * scheduler-aware lock.
       */

      ret = rpmsg_trysend(&priv->ept, data, len);
      if (ret >= 0)
        {
          return OK;
        }

      /* A transient lack of a TX buffer is normal with two concurrent
       * maximum-size senders.  CPU2 has no local SysTick, so a signal sleep
       * here can become unbounded.  Keep the retry AON-bounded and use a
       * short architecture delay; the higher-priority RPMsg/mailbox workers
       * can still preempt this test task and return buffers.
       */

      up_udelay(50);
    }
  while ((uint32_t)(bk7258_rpmsg_test_aon_tick() - start) < timeout_ticks);

  return ret < 0 ? ret : -ETIMEDOUT;
}

#ifdef CONFIG_BK7258_AP_CORE
static int bk7258_rpmsg_test_submit(uint32_t slot, FAR const void *data,
                                     size_t len, uint32_t timeout_ms)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  struct bk7258_rpmsg_test_tx_request_s *request;
  uint32_t frequency;
  uint32_t start;
  uint32_t timeout_ticks;
  int status;
  int ret;

  if (slot >= 2 || data == NULL || len > BK7258_RPMSG_TEST_FRAME_SIZE)
    {
      return -EINVAL;
    }

  request = &priv->tx_request[slot];
  bk7258_rpmsg_test_flush_sem(&priv->tx_done_sem[slot]);
  memcpy(request->data, data, len);
  request->len = len;
  request->timeout_ms = timeout_ms;
  __atomic_store_n(&request->status, -EINPROGRESS, __ATOMIC_RELEASE);
  __asm volatile ("dmb sy" ::: "memory");
  __atomic_fetch_or(&priv->tx_pending, 1u << slot, __ATOMIC_RELEASE);

  /* The current AP SMP bootstrap does not give CPU2 an independent system
   * tick.  More importantly, a CPU2 -> CPU0 semaphore wake can remain
   * pending until some other CPU0 scheduling event.  Keep the fast event
   * wake for CPU0 producers and let the gateway's CPU0 timed level poll
   * discover CPU2 requests.  The request bit is the source of truth; the
   * semaphore is only an acceleration hint.
   */

  if (up_cpu_index() == 0)
    {
      (void)nxsem_post(&priv->tx_sem);
      ret = nxsem_wait_uninterruptible(&priv->tx_done_sem[slot]);
      if (ret < 0)
        {
          return ret;
        }

      __asm volatile ("dmb sy" ::: "memory");
      return __atomic_load_n(&request->status, __ATOMIC_ACQUIRE);
    }

  /* CPU2 has no local SysTick and its current board bootstrap cannot make
   * repeated cross-core semaphore wakeups a reliable transport primitive.
   * The request payload lives in the fixed gateway slot above, so CPU2 can
   * wait on the release/acquire status without exposing a stack pointer to a
   * late gateway.  The shared AON RTC supplies the timeout boundary without
   * entering the SMP scheduler on every RPMsg frame.
   */

  frequency = bk_rtc_get_clock_freq();
  start = bk7258_rpmsg_test_aon_tick();
  timeout_ticks =
    (uint32_t)(((uint64_t)timeout_ms * frequency + 999u) / 1000u);

  do
    {
      status = __atomic_load_n(&request->status, __ATOMIC_ACQUIRE);
      if (status != -EINPROGRESS)
        {
          return status;
        }

      if (__atomic_load_n(&priv->abort, __ATOMIC_ACQUIRE))
        {
          return -ECANCELED;
        }

      up_udelay(50);
    }
  while ((uint32_t)(bk7258_rpmsg_test_aon_tick() - start) < timeout_ticks);

  status = -EINPROGRESS;
  (void)__atomic_compare_exchange_n(&request->status, &status,
                                    -ETIMEDOUT, false,
                                    __ATOMIC_ACQ_REL, __ATOMIC_ACQUIRE);
  return __atomic_load_n(&request->status, __ATOMIC_ACQUIRE);
}

static FAR void *bk7258_rpmsg_test_tx_gateway(FAR void *arg)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  uint32_t pending;
  uint32_t slot;
  int ret;

  (void)arg;
  for (; ; )
    {
      if (__atomic_load_n(&priv->shutdown, __ATOMIC_ACQUIRE))
        {
          break;
        }

      pending = __atomic_exchange_n(&priv->tx_pending, 0,
                                    __ATOMIC_ACQ_REL);
      if (pending == 0)
        {
          /* This thread is pinned to logical CPU0, whose system tick is the
           * supported timeout owner.  Polling the level bit also closes the
           * CPU2 -> CPU0 missed-edge window without entering OpenAMP from
           * CPU2 or modifying NuttX semaphore/IPI code.
           */

          (void)nxsem_tickwait_uninterruptible(
                  &priv->tx_sem,
                  MSEC2TICK(BK7258_RPMSG_TEST_TX_POLL_MS));
          continue;
        }

      for (slot = 0; slot < 2; slot++)
        {
          struct bk7258_rpmsg_test_tx_request_s *request;

          if ((pending & (1u << slot)) == 0)
            {
              continue;
            }

          request = &priv->tx_request[slot];
          if (__atomic_load_n(&request->status, __ATOMIC_ACQUIRE) ==
              -EINPROGRESS)
            {
              ret = bk7258_rpmsg_test_send_bounded(
                      request->data, request->len,
                      request->timeout_ms);
              __atomic_store_n(&request->status, ret, __ATOMIC_RELEASE);
            }

          __asm volatile ("dmb sy" ::: "memory");
          if (slot == 0)
            {
              (void)nxsem_post(&priv->tx_done_sem[slot]);
            }
          else
            {
              __asm volatile ("sev" ::: "memory");
            }
        }
    }

