open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsg_test.c
  return NULL;
}
#endif

static bool bk7258_rpmsg_test_wire_valid(
  const struct bk7258_rpmsg_test_wire_s *msg, size_t len)
{
  return msg != NULL && len >= BK7258_RPMSG_TEST_WIRE_HEADER_SIZE &&
         len <= BK7258_RPMSG_TEST_FRAME_SIZE &&
         msg->magic == BK7258_RPMSG_TEST_WIRE_MAGIC &&
         msg->version == BK7258_RPMSG_TEST_WIRE_VERSION;
}

static bool bk7258_rpmsg_test_payload_valid(
  const struct bk7258_rpmsg_test_wire_s *msg, size_t len)
{
  uint32_t i;

  if (msg->payload_size == 0 ||
      msg->payload_size > BK7258_RPMSG_TEST_MAX_PAYLOAD ||
      len != BK7258_RPMSG_TEST_WIRE_HEADER_SIZE + msg->payload_size)
    {
      return false;
    }

  for (i = 0; i < msg->payload_size; i++)
    {
      if (msg->data[i] !=
          (uint8_t)(msg->sequence + msg->slot + i))
        {
          return false;
        }
    }

  return true;
}

#ifdef CONFIG_BK7258_AP_CORE

static int bk7258_rpmsg_test_u32_compare(const void *lhs, const void *rhs)
{
  uint32_t a = *(const uint32_t *)lhs;
  uint32_t b = *(const uint32_t *)rhs;

  return a < b ? -1 : a > b;
}

static uint32_t bk7258_rpmsg_test_ticks_to_cycles(uint32_t elapsed_ticks,
                                                  uint32_t frequency)
{
  uint64_t cycles = (uint64_t)elapsed_ticks * frequency /
                    bk_rtc_get_clock_freq();

  return cycles > UINT32_MAX ? UINT32_MAX : (uint32_t)cycles;
}

static int bk7258_rpmsg_test_wait_reply(uint32_t slot,
                                        uint32_t timeout_ms)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  uint32_t frequency;
  uint32_t start;
  uint32_t timeout_ticks;

  if (up_cpu_index() == 0)
    {
      return nxsem_tickwait_uninterruptible(&priv->reply_sem[slot],
                                             MSEC2TICK(timeout_ms));
    }

  /* Avoid a scheduler-mediated CPU0 -> CPU2 semaphore wake for every echo.
   * The callback publishes reply_status with release ordering and the AON
   * RTC gives CPU2 a real timeout even though it has no local SysTick.
   */

  frequency = bk_rtc_get_clock_freq();
  start = bk7258_rpmsg_test_aon_tick();
  timeout_ticks =
    (uint32_t)(((uint64_t)timeout_ms * frequency + 999u) / 1000u);

  do
    {
      if (__atomic_load_n(&priv->reply_status[slot], __ATOMIC_ACQUIRE) !=
          -EINPROGRESS)
        {
          return OK;
        }

      if (__atomic_load_n(&priv->abort, __ATOMIC_ACQUIRE))
        {
          return -ECANCELED;
        }

      if (!bk7258_rpmsg_test_endpoint_ready())
        {
          return -ENOTCONN;
        }

      up_udelay(50);
    }
  while ((uint32_t)(bk7258_rpmsg_test_aon_tick() - start) < timeout_ticks);

  return -ETIMEDOUT;
}

static void bk7258_rpmsg_test_finalize_cpu(uint32_t slot)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  struct bk7258_rpmsg_test_cpu_result_s *cpu = &priv->result.cpu[slot];
  uint32_t count = cpu->received;

  if (count == 0)
    {
      return;
    }

  qsort(priv->latency[slot], count, sizeof(uint32_t),
        bk7258_rpmsg_test_u32_compare);
  cpu->min_cycles = priv->latency[slot][0];
  cpu->p50_cycles = priv->latency[slot][(count * 50u + 99u) / 100u - 1u];
  cpu->p95_cycles = priv->latency[slot][(count * 95u + 99u) / 100u - 1u];
  cpu->p99_cycles = priv->latency[slot][(count * 99u + 99u) / 100u - 1u];
  cpu->max_cycles = priv->latency[slot][count - 1u];
}

static int bk7258_rpmsg_test_attr_initialize(pthread_attr_t *attr,
                                              uint32_t cpu,
                                              int priority)
{
  struct sched_param param;
  cpu_set_t cpuset = (cpu_set_t)(1u << cpu);
  int initialized = 0;
  int ret;

  ret = pthread_attr_init(attr);
  if (ret == 0)
    {
      initialized = 1;
      ret = pthread_attr_setdetachstate(attr, PTHREAD_CREATE_JOINABLE);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setstacksize(attr, BK7258_RPMSG_TEST_THREAD_STACK);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setaffinity_np(attr, sizeof(cpuset), &cpuset);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setinheritsched(attr, PTHREAD_EXPLICIT_SCHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setschedpolicy(attr, SCHED_FIFO);
    }

  if (ret == 0)
    {
      memset(&param, 0, sizeof(param));
      param.sched_priority = priority;
      ret = pthread_attr_setschedparam(attr, &param);
    }

  if (ret != 0 && initialized)
    {
      (void)pthread_attr_destroy(attr);
    }

  return ret;
}

static void bk7258_rpmsg_test_run_worker(uint32_t slot)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  struct bk7258_rpmsg_test_cpu_result_s *cpu;
  struct bk7258_rpmsg_test_wire_s msg;
  uint32_t reply_timeout;
  uint32_t sequence;
  uint32_t elapsed_cycles;
  uint32_t start;
  uint32_t end;
  uint32_t i;
  int ret = OK;

  cpu = &priv->result.cpu[slot];
  cpu->sender_cpu = (uint32_t)up_cpu_index();
  if (cpu->sender_cpu != slot)
    {
      ret = -EXDEV;
      cpu->errors++;
      goto done;
    }

  reply_timeout = priv->timeout_ms < BK7258_RPMSG_TEST_REPLY_TIMEOUT ?
                  priv->timeout_ms : BK7258_RPMSG_TEST_REPLY_TIMEOUT;

  for (sequence = 1; sequence <= priv->count; sequence++)
    {
      if (__atomic_load_n(&priv->abort, __ATOMIC_ACQUIRE))
        {
          ret = -ECANCELED;
          break;
        }

      memset(&msg, 0, BK7258_RPMSG_TEST_WIRE_HEADER_SIZE);
      msg.magic = BK7258_RPMSG_TEST_WIRE_MAGIC;
      msg.version = BK7258_RPMSG_TEST_WIRE_VERSION;
      msg.command = BK7258_RPMSG_TEST_COMMAND_ECHO;
      msg.generation = priv->generation;
      msg.run_id = priv->run_id;
      msg.sequence = sequence;
      msg.slot = slot;
      msg.payload_size = priv->payload_size;
      for (i = 0; i < msg.payload_size; i++)
        {
          msg.data[i] = (uint8_t)(sequence + slot + i);
        }

      __atomic_store_n(&priv->reply_status[slot], -EINPROGRESS,
                       __ATOMIC_RELEASE);
      priv->awaiting[slot] = sequence;
      __asm volatile ("dmb sy" ::: "memory");
      /* DWT_CYCCNT is banked per physical Cortex-M33 and CPU2 does not run
       * the CPU0 timer initialization path.  NuttX's system-tick seqlock also
       * cannot be used safely from this board's CPU2 bootstrap path.  Follow
       * the official BK7258 SMP SDK interrupt recorder and use the shared AON
       * RTC, then express the measured microseconds in AP clock cycles.
       */

      start = bk7258_rpmsg_test_aon_tick();
      ret = bk7258_rpmsg_test_submit(
              slot, &msg,
              BK7258_RPMSG_TEST_WIRE_HEADER_SIZE + msg.payload_size,
              BK7258_RPMSG_TEST_SEND_TIMEOUT);
      if (ret < 0)
        {
          cpu->errors++;
          __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
          break;
        }

      cpu->sent++;
      ret = bk7258_rpmsg_test_wait_reply(slot, reply_timeout);
      end = bk7258_rpmsg_test_aon_tick();
      if (ret < 0)
        {
          cpu->errors++;
          __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
          break;
        }

      __asm volatile ("dmb sy" ::: "memory");
      ret = priv->reply_status[slot];
      if (ret < 0 || !bk7258_rpmsg_test_endpoint_ready())
        {
          if (ret >= 0)
            {
              ret = -ENOTCONN;
            }

