open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsg_test.c
          cpu->errors++;
          __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
          break;
        }

      elapsed_cycles = bk7258_rpmsg_test_ticks_to_cycles(
                         end - start, priv->result.frequency);
      priv->latency[slot][cpu->received] = elapsed_cycles;
      cpu->total_cycles += elapsed_cycles;
      cpu->received++;
    }

done:
  priv->worker_status[slot] = ret;
  __atomic_fetch_add(&priv->workers_done, 1u, __ATOMIC_RELEASE);

  /* As with the TX request path, use the atomic count as the cross-core
   * level state.  A CPU2 -> CPU0 semaphore post can lose its scheduling edge
   * in the current AP bootstrap, so only the CPU0 worker supplies the fast
   * hint.  The CPU0 controller polls workers_done with a bounded tick wait.
   */

  if (up_cpu_index() == 0)
    {
      (void)nxsem_post(&priv->done_sem);
    }
}

static FAR void *bk7258_rpmsg_test_worker(FAR void *arg)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  uint32_t slot = (uint32_t)(uintptr_t)arg;
  uint32_t dispatch = 0;
  int ret;

  /* Short-lived pthreads that exit on AP logical CPU1 leave their stack/TCB
   * cleanup dependent on a matching join.  The stress test used to create
   * two fresh workers per request and therefore consumed one 4360-byte
   * allocation on every run until pthread_create() returned ENOMEM.  Keep
   * one joinable, pinned worker per logical CPU for the AP lifetime and
   * dispatch requests with counting semaphores instead.  Initialization
   * failure joins those workers before releasing their semaphore state.
   */

  for (; ; )
    {
      if (__atomic_load_n(&priv->shutdown, __ATOMIC_ACQUIRE))
        {
          break;
        }

      if (slot == 0)
        {
          ret = nxsem_wait_uninterruptible(&priv->worker_start_sem[slot]);
          if (ret < 0)
            {
              continue;
            }
        }
      else
        {
          /* Keep CPU2 out of the fragile cross-core semaphore wake path.
           * The controller publishes all request fields before incrementing
           * this sequence and executes SEV.  WFE is only an acceleration;
           * the AP heartbeat also emits SEV periodically, so a missed event
           * cannot hide a changed level value.
           */

          while (__atomic_load_n(&priv->worker_dispatch[slot],
                                  __ATOMIC_ACQUIRE) == dispatch &&
                 !__atomic_load_n(&priv->shutdown, __ATOMIC_ACQUIRE))
            {
              __asm volatile ("wfe" ::: "memory");
            }

          dispatch = __atomic_load_n(&priv->worker_dispatch[slot],
                                     __ATOMIC_ACQUIRE);
        }

      if (__atomic_load_n(&priv->shutdown, __ATOMIC_ACQUIRE))
        {
          break;
        }

      __asm volatile ("dmb sy" ::: "memory");
      bk7258_rpmsg_test_run_worker(slot);
    }

  return NULL;
}

static FAR void *bk7258_rpmsg_test_load_worker(FAR void *arg)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  volatile uint32_t value = 0;
  uint32_t i;
  int ret;

  (void)arg;
  for (; ; )
    {
      if (__atomic_load_n(&priv->shutdown, __ATOMIC_ACQUIRE))
        {
          break;
        }

      ret = nxsem_wait_uninterruptible(&priv->load_start_sem);
      if (ret < 0)
        {
          continue;
        }

      while (!__atomic_load_n(&priv->load_stop, __ATOMIC_ACQUIRE) &&
             !__atomic_load_n(&priv->shutdown, __ATOMIC_ACQUIRE))
        {
          for (i = 0; i < 4096; i++)
            {
              value = value * 1664525u + 1013904223u;
            }

          /* This task is pinned to CPU0 below every transport, health and
           * test-control priority.  Preemption therefore gives those tasks
           * bounded progress while this loop consumes otherwise idle CPU0
           * cycles.  sched_yield() would only rotate equal-priority tasks;
           * with no such peer it repeatedly enters NuttX's global SMP
           * scheduler without yielding useful work and can turn this load
           * generator into a scheduler/IPI storm.
           */
        }

      (void)nxsem_post(&priv->load_done_sem);
    }

  (void)value;
  return NULL;
}

static void bk7258_rpmsg_test_heap_snapshot(
  struct bk7258_rpmsg_test_heap_result_s *snapshot)
{
  struct mallinfo info = mallinfo();

  snapshot->arena = info.arena;
  snapshot->allocated_blocks = info.aordblks;
  snapshot->free_blocks = info.ordblks;
  snapshot->largest_free = info.mxordblk;
  snapshot->allocated_bytes = info.uordblks;
  snapshot->free_bytes = info.fordblks;
}

static int bk7258_rpmsg_test_spawn(pthread_t *thread, uint32_t cpu,
                                    int priority,
                                    pthread_startroutine_t entry,
                                    FAR void *arg,
                                    uint32_t *failure_stage)
{
  pthread_attr_t attr;
  int ret;

  *failure_stage = BK7258_RPMSG_TEST_SPAWN_STAGE_ATTR;
  ret = bk7258_rpmsg_test_attr_initialize(&attr, cpu, priority);
  if (ret != 0)
    {
      return -ret;
    }

  *failure_stage = BK7258_RPMSG_TEST_SPAWN_STAGE_CREATE;
  ret = pthread_create(thread, &attr, entry, arg);
  (void)pthread_attr_destroy(&attr);
  if (ret == 0)
    {
      *failure_stage = BK7258_RPMSG_TEST_SPAWN_STAGE_NONE;
    }

  return ret == 0 ? OK : -ret;
}

static void bk7258_rpmsg_test_prepare_result(void)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;

  memset(&priv->result, 0, sizeof(priv->result));
  priv->result.magic = BK7258_RPMSG_TEST_RESULT_MAGIC;
  priv->result.version = BK7258_RPMSG_TEST_RESULT_VERSION;
  priv->result.size = sizeof(priv->result);
  priv->result.generation = priv->generation;
  priv->result.run_id = priv->run_id;
  priv->result.count = priv->count;
  priv->result.payload_size = priv->payload_size;
  priv->result.frame_size = BK7258_RPMSG_TEST_WIRE_HEADER_SIZE +
                            priv->payload_size;
  priv->result.flags = priv->flags;
  priv->result.frequency = up_perf_getfreq();
  priv->result.controller_cpu = (uint32_t)up_cpu_index();
  bk7258_rpmsg_test_heap_snapshot(&priv->result.heap_start);
}

static int bk7258_rpmsg_test_send_report(int status, bool release)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  struct bk7258_rpmsg_test_wire_s msg;

  priv->result.status = status;
  memset(&msg, 0, BK7258_RPMSG_TEST_WIRE_HEADER_SIZE);
  msg.magic = BK7258_RPMSG_TEST_WIRE_MAGIC;
  msg.version = BK7258_RPMSG_TEST_WIRE_VERSION;
  msg.command = BK7258_RPMSG_TEST_COMMAND_REPORT;
  msg.generation = priv->generation;
  msg.run_id = priv->run_id;
  msg.value = (uint32_t)status;
  memcpy(msg.data, &priv->result, sizeof(priv->result));

