open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsg_test.c
  /* The CP can submit the next run as soon as it receives this immutable
   * local report.  Release busy before publishing the report so that the
   * next START cannot race with a trailing busy clear.  The controller will
   * consume the already-posted start semaphore after this send returns.
   */

  if (release)
    {
      __atomic_store_n(&priv->busy, false, __ATOMIC_RELEASE);
    }

  return bk7258_rpmsg_test_send_bounded(
           &msg, BK7258_RPMSG_TEST_WIRE_HEADER_SIZE + sizeof(priv->result),
           BK7258_RPMSG_TEST_SEND_TIMEOUT);
}

static int bk7258_rpmsg_test_controller(int argc, FAR char *argv[])
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  uint32_t expected;
  uint32_t i;
  clock_t wait_start;
  clock_t wait_limit;
  clock_t wait_slice;
  clock_t elapsed;
  int load_started;
  int status;
  int ret;

  (void)argc;
  (void)argv;

  for (; ; )
    {
      ret = nxsem_wait_uninterruptible(&priv->start_sem);
      if (__atomic_load_n(&priv->shutdown, __ATOMIC_ACQUIRE))
        {
          break;
        }

      if (ret < 0 || !__atomic_load_n(&priv->busy, __ATOMIC_ACQUIRE))
        {
          continue;
        }

      bk7258_rpmsg_test_flush_sem(&priv->done_sem);
      bk7258_rpmsg_test_flush_sem(&priv->load_done_sem);
      for (i = 0; i < 2; i++)
        {
          bk7258_rpmsg_test_flush_sem(&priv->reply_sem[i]);
          priv->awaiting[i] = 0;
          priv->reply_status[i] = -EINPROGRESS;
          priv->worker_status[i] = -EINPROGRESS;
          memset(priv->latency[i], 0, sizeof(priv->latency[i]));
        }

      priv->workers_done = 0;
      __atomic_store_n(&priv->abort, false, __ATOMIC_RELEASE);
      __atomic_store_n(&priv->load_stop, false, __ATOMIC_RELEASE);
      bk7258_rpmsg_test_prepare_result();
      __asm volatile ("dmb sy" ::: "memory");

      load_started = 0;
      status = OK;
      if ((priv->flags & BK7258_RPMSG_TEST_FLAG_CPU0_LOAD) != 0)
        {
          priv->result.spawn_target =
            BK7258_RPMSG_TEST_SPAWN_TARGET_LOAD;
          priv->result.spawn_stage =
            BK7258_RPMSG_TEST_SPAWN_STAGE_DISPATCH;
          ret = nxsem_post(&priv->load_start_sem);
          if (ret < 0)
            {
              status = ret;
              priv->result.spawn_status = ret;
            }
          else
            {
              load_started = 1;
              priv->result.spawn_target =
                BK7258_RPMSG_TEST_SPAWN_TARGET_NONE;
              priv->result.spawn_stage =
                BK7258_RPMSG_TEST_SPAWN_STAGE_NONE;
            }
        }

      expected = 0;
      for (i = 0; i < 2 && status >= 0; i++)
        {
          priv->result.spawn_target =
            i == 0 ? BK7258_RPMSG_TEST_SPAWN_TARGET_CPU0 :
                     BK7258_RPMSG_TEST_SPAWN_TARGET_CPU1;
          priv->result.spawn_stage =
            BK7258_RPMSG_TEST_SPAWN_STAGE_DISPATCH;
          if (i == 1)
            {
              __atomic_fetch_add(&priv->worker_dispatch[i], 1u,
                                 __ATOMIC_RELEASE);
              __asm volatile ("dmb sy; sev" ::: "memory");
              ret = OK;
            }
          else
            {
              ret = nxsem_post(&priv->worker_start_sem[i]);
            }

          if (ret < 0)
            {
              status = ret;
              priv->result.spawn_status = ret;
              __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
              break;
            }

          expected++;
          priv->result.spawn_target =
            BK7258_RPMSG_TEST_SPAWN_TARGET_NONE;
          priv->result.spawn_stage =
            BK7258_RPMSG_TEST_SPAWN_STAGE_NONE;
        }

      priv->result.workers_expected = expected;
      bk7258_rpmsg_test_heap_snapshot(&priv->result.heap_after_spawn);

      wait_start = clock_systime_ticks();
      wait_limit = MSEC2TICK(
                     priv->timeout_ms > BK7258_RPMSG_TEST_REPORT_MARGIN ?
                     priv->timeout_ms - BK7258_RPMSG_TEST_REPORT_MARGIN :
                     priv->timeout_ms / 2u);
      wait_slice = MSEC2TICK(BK7258_RPMSG_TEST_DONE_POLL_MS);
      if (wait_slice < 1)
        {
          wait_slice = 1;
        }

      while (__atomic_load_n(&priv->workers_done,
                             __ATOMIC_ACQUIRE) < expected)
        {
          elapsed = clock_systime_ticks() - wait_start;
          if (elapsed >= wait_limit)
            {
              if (status >= 0)
                {
                  status = -ETIMEDOUT;
                }

              __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
              break;
            }

          (void)nxsem_tickwait_uninterruptible(
                  &priv->done_sem,
                  wait_slice < wait_limit - elapsed ?
                  wait_slice : wait_limit - elapsed);
        }

      if (__atomic_load_n(&priv->workers_done, __ATOMIC_ACQUIRE) < expected)
        {
          clock_t cleanup_start = clock_systime_ticks();
          clock_t cleanup_limit =
            MSEC2TICK(BK7258_RPMSG_TEST_CLEANUP_TIMEOUT);

          __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
          (void)nxsem_post(&priv->reply_sem[0]);
          __asm volatile ("dmb sy; sev" ::: "memory");

          while (__atomic_load_n(&priv->workers_done,
                                 __ATOMIC_ACQUIRE) < expected)
            {
              elapsed = clock_systime_ticks() - cleanup_start;
              if (elapsed >= cleanup_limit)
                {
                  if (status >= 0)
                    {
                      status = -ETIMEDOUT;
                    }

                  break;
                }

              (void)nxsem_tickwait_uninterruptible(
                      &priv->done_sem,
                      wait_slice < cleanup_limit - elapsed ?
                      wait_slice : cleanup_limit - elapsed);
            }
        }

      __atomic_store_n(&priv->load_stop, true, __ATOMIC_RELEASE);
      if (load_started)
        {
          ret = nxsem_tickwait_uninterruptible(
                  &priv->load_done_sem, MSEC2TICK(1000));
          if (ret < 0 && status >= 0)
            {
              status = ret;
            }
        }

      priv->result.workers_done =
        __atomic_load_n(&priv->workers_done, __ATOMIC_ACQUIRE);
      bk7258_rpmsg_test_heap_snapshot(&priv->result.heap_report);

      for (i = 0; i < 2; i++)
        {
          bk7258_rpmsg_test_finalize_cpu(i);
          if (status >= 0 && priv->worker_status[i] < 0)
            {
              status = priv->worker_status[i];
            }

          if (status >= 0 &&
              (priv->result.cpu[i].sent != priv->count ||
               priv->result.cpu[i].received != priv->count ||
               priv->result.cpu[i].errors != 0 ||
               priv->result.cpu[i].sender_cpu != i ||
               priv->result.cpu[i].callback_cpu_mask != 1u ||
               priv->result.cpu[i].min_cycles == 0 ||
               priv->result.cpu[i].max_cycles == 0))
            {
              status = -EIO;
            }
        }

      ret = bk7258_rpmsg_test_send_report(
              status,
              __atomic_load_n(&priv->workers_done,
                              __ATOMIC_ACQUIRE) == expected);

      /* The stock syslog_rpmsg endpoint is established asynchronously by
       * Name Service.  Emit the N9-F probe only after a complete request and
       * report exchange proves that the link is connected.  Keeping this
       * behind an explicit flag also prevents syslog traffic from disturbing
       * the latency and throughput matrix.
       */

      if (ret >= 0 && status >= 0 &&
          (priv->flags & BK7258_RPMSG_TEST_FLAG_SYSLOG_PROBE) != 0)
        {
          syslog(LOG_ERR,
                 "BK7258 AP RPMsg syslog probe gen=%lu run=%lu\n",
                 (unsigned long)priv->generation,
                 (unsigned long)priv->run_id);
        }
    }

  return OK;
}

