open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsg_test.c
static FAR void *bk7258_rpmsg_test_controller_thread(FAR void *arg)
{
  (void)arg;
  (void)bk7258_rpmsg_test_controller(0, NULL);
  return NULL;
}

static void bk7258_rpmsg_test_send_error_report(
  const struct bk7258_rpmsg_test_wire_s *request, int status)
{
  struct bk7258_rpmsg_test_result_s result;
  struct bk7258_rpmsg_test_wire_s msg;

  memset(&result, 0, sizeof(result));
  result.magic = BK7258_RPMSG_TEST_RESULT_MAGIC;
  result.version = BK7258_RPMSG_TEST_RESULT_VERSION;
  result.size = sizeof(result);
  result.generation = request->generation;
  result.run_id = request->run_id;
  result.count = request->sequence;
  result.payload_size = request->payload_size;
  result.flags = request->slot;
  result.status = status;

  memset(&msg, 0, BK7258_RPMSG_TEST_WIRE_HEADER_SIZE);
  msg.magic = BK7258_RPMSG_TEST_WIRE_MAGIC;
  msg.version = BK7258_RPMSG_TEST_WIRE_VERSION;
  msg.command = BK7258_RPMSG_TEST_COMMAND_REPORT;
  msg.generation = request->generation;
  msg.run_id = request->run_id;
  msg.value = (uint32_t)status;
  memcpy(msg.data, &result, sizeof(result));
  (void)bk7258_rpmsg_test_send_bounded(
          &msg, BK7258_RPMSG_TEST_WIRE_HEADER_SIZE + sizeof(result),
          BK7258_RPMSG_TEST_SEND_TIMEOUT);
}

#endif /* CONFIG_BK7258_AP_CORE */

static int bk7258_rpmsg_test_ept_cb(FAR struct rpmsg_endpoint *ept,
                                     FAR void *data, size_t len,
                                     uint32_t src, FAR void *priv_)
{
  struct bk7258_rpmsg_test_dev_s *priv = priv_;
  struct bk7258_rpmsg_test_wire_s *msg = data;

  (void)ept;
  (void)src;
  if (!bk7258_rpmsg_test_wire_valid(msg, len))
    {
      return -EINVAL;
    }

#ifdef CONFIG_BK7258_AP_CORE
  if (msg->command == BK7258_RPMSG_TEST_COMMAND_START)
    {
      volatile struct bk7258_rptun_control_s *control =
        bk7258_rptun_control();
      bool expected = false;

      if (msg->generation != control->generation || msg->sequence == 0 ||
          msg->sequence > BK7258_RPMSG_TEST_MAX_COUNT ||
          msg->payload_size == 0 ||
          msg->payload_size > BK7258_RPMSG_TEST_MAX_PAYLOAD ||
          msg->value < BK7258_RPMSG_TEST_MIN_TIMEOUT ||
          msg->value > BK7258_RPMSG_TEST_MAX_TIMEOUT ||
          (msg->slot & ~BK7258_RPMSG_TEST_VALID_FLAGS) != 0)
        {
          bk7258_rpmsg_test_send_error_report(msg, -EINVAL);
          return -EINVAL;
        }

      if (!__atomic_compare_exchange_n(&priv->busy, &expected, true, false,
                                       __ATOMIC_ACQ_REL,
                                       __ATOMIC_ACQUIRE))
        {
          bk7258_rpmsg_test_send_error_report(msg, -EBUSY);
          return -EBUSY;
        }

      priv->generation = msg->generation;
      priv->run_id = msg->run_id;
      priv->count = msg->sequence;
      priv->payload_size = msg->payload_size;
      priv->flags = msg->slot;
      priv->timeout_ms = msg->value;
      __asm volatile ("dmb sy" ::: "memory");
      (void)nxsem_post(&priv->start_sem);
      return OK;
    }

  if (msg->command == BK7258_RPMSG_TEST_COMMAND_ECHO_RESPONSE &&
      msg->generation == priv->generation &&
      msg->run_id == priv->run_id && msg->slot < 2 &&
      msg->sequence == priv->awaiting[msg->slot])
    {
      int status = (int32_t)msg->value;

      if (status >= 0 && !bk7258_rpmsg_test_payload_valid(msg, len))
        {
          status = -EBADMSG;
        }

      __atomic_fetch_or(&priv->result.cpu[msg->slot].callback_cpu_mask,
                        1u << up_cpu_index(), __ATOMIC_RELAXED);
      __atomic_store_n(&priv->reply_status[msg->slot], status,
                       __ATOMIC_RELEASE);
      __asm volatile ("dmb sy" ::: "memory");
      if (msg->slot == 0)
        {
          (void)nxsem_post(&priv->reply_sem[msg->slot]);
        }
      else
        {
          __asm volatile ("sev" ::: "memory");
        }

      return OK;
    }
#else
  if (msg->command == BK7258_RPMSG_TEST_COMMAND_ECHO && msg->slot < 2)
    {
      volatile struct bk7258_rptun_control_s *control =
        bk7258_rptun_control();
      int status = OK;

      if (msg->generation != control->generation ||
          !bk7258_rpmsg_test_payload_valid(msg, len))
        {
          status = -EBADMSG;
        }

      msg->command = BK7258_RPMSG_TEST_COMMAND_ECHO_RESPONSE;
      msg->value = (uint32_t)status;
      return bk7258_rpmsg_test_send_bounded(
               msg, len, BK7258_RPMSG_TEST_SEND_TIMEOUT);
    }

  if (msg->command == BK7258_RPMSG_TEST_COMMAND_REPORT &&
      msg->generation == priv->waiting_generation &&
      msg->run_id == priv->waiting_run_id &&
      len == BK7258_RPMSG_TEST_WIRE_HEADER_SIZE +
             sizeof(struct bk7258_rpmsg_test_result_s))
    {
      memcpy(&priv->report, msg->data, sizeof(priv->report));
      __asm volatile ("dmb sy" ::: "memory");
      priv->report_valid = true;
      (void)nxsem_post(&priv->report_sem);
      return OK;
    }
#endif

  return -ENOMSG;
}

static void bk7258_rpmsg_test_device_created(FAR struct rpmsg_device *rdev,
                                              FAR void *priv_)
{
  struct bk7258_rpmsg_test_dev_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);
#ifdef CONFIG_BK7258_AP_CORE
  int ret;
#endif

  if (cpuname == NULL || strcmp(cpuname, BK7258_RPMSG_TEST_REMOTE_NAME) != 0)
    {
      return;
    }

#ifdef CONFIG_BK7258_AP_CORE
  priv->ept.priv = priv;
  ret = rpmsg_create_ept(&priv->ept, rdev, BK7258_RPMSG_TEST_EPT_NAME,
                         RPMSG_ADDR_ANY, RPMSG_ADDR_ANY,
                         bk7258_rpmsg_test_ept_cb, NULL);
  if (ret >= 0)
    {
      priv->connection_error = OK;
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
  else
    {
      priv->connection_error = ret;
    }
#else
  /* The AP announces the service through RPMsg Name Service.  The CP binds
   * it in bk7258_rpmsg_test_ns_bind(), matching stock server-side services
   * such as syslog_rpmsg_server instead of bypassing NS with two static
   * endpoints.
   */

