open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsg_test.c
  priv->connection_error = OK;
#endif
}

#ifndef CONFIG_BK7258_AP_CORE
static bool bk7258_rpmsg_test_ns_match(FAR struct rpmsg_device *rdev,
                                        FAR void *priv_,
                                        FAR const char *name,
                                        uint32_t dest)
{
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  (void)priv_;
  (void)dest;
  return cpuname != NULL &&
         strcmp(cpuname, BK7258_RPMSG_TEST_REMOTE_NAME) == 0 &&
         strcmp(name, BK7258_RPMSG_TEST_EPT_NAME) == 0;
}

static void bk7258_rpmsg_test_ns_bind(FAR struct rpmsg_device *rdev,
                                       FAR void *priv_,
                                       FAR const char *name,
                                       uint32_t dest)
{
  struct bk7258_rpmsg_test_dev_s *priv = priv_;
  int ret;

  priv->ept.priv = priv;
  ret = rpmsg_create_ept(&priv->ept, rdev, name,
                         RPMSG_ADDR_ANY, dest,
                         bk7258_rpmsg_test_ept_cb, NULL);
  if (ret >= 0)
    {
      priv->connection_error = OK;
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
      bk7258_rptun_mark_connected();
    }
  else
    {
      priv->connection_error = ret;
    }
}
#endif

static void bk7258_rpmsg_test_device_destroy(FAR struct rpmsg_device *rdev,
                                              FAR void *priv_)
{
  struct bk7258_rpmsg_test_dev_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL || strcmp(cpuname, BK7258_RPMSG_TEST_REMOTE_NAME) != 0)
    {
      return;
    }

  __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
  priv->connection_error = -ENOTCONN;
#ifdef CONFIG_BK7258_AP_CORE
  __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
  (void)nxsem_post(&priv->start_sem);
  (void)nxsem_post(&priv->reply_sem[0]);
  __asm volatile ("dmb sy; sev" ::: "memory");
#else
  (void)nxsem_post(&priv->report_sem);
#endif
  if (priv->ept.rdev != NULL)
    {
      rpmsg_destroy_ept(&priv->ept);
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_rpmsg_test_initialize(void)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
#ifdef CONFIG_BK7258_AP_CORE
  sem_t *semaphores[] =
  {
    &priv->start_sem,
    &priv->done_sem,
    &priv->worker_start_sem[0],
    &priv->worker_start_sem[1],
    &priv->reply_sem[0],
    &priv->reply_sem[1],
    &priv->load_start_sem,
    &priv->load_done_sem,
    &priv->tx_sem,
    &priv->tx_done_sem[0],
    &priv->tx_done_sem[1]
  };
  pthread_t threads[5];
  size_t semaphore_count = 0;
  size_t thread_count = 0;
  uint32_t i;
  uint32_t spawn_stage;
#else
  bool report_sem_initialized = false;
#endif
  bool callback_registered = false;
  bool expected = false;
  int ret;

  if (!__atomic_compare_exchange_n(&priv->initialized, &expected, true,
                                   false, __ATOMIC_ACQ_REL,
                                   __ATOMIC_ACQUIRE))
    {
      return OK;
    }

#ifdef CONFIG_BK7258_AP_CORE
  bk7258_rpmsg_test_reset_runtime(priv);
  ret = OK;
  while (semaphore_count < sizeof(semaphores) / sizeof(semaphores[0]) &&
         ret >= 0)
    {
      ret = bk7258_rpmsg_test_sem_init(semaphores[semaphore_count]);
      if (ret >= 0)
        {
          semaphore_count++;
        }
    }

  if (ret >= 0)
    {
      ret = bk7258_rpmsg_test_spawn(
              &threads[thread_count], 0, BK7258_RPMSG_TEST_TX_PRIO,
              bk7258_rpmsg_test_tx_gateway, NULL, &spawn_stage);
      if (ret >= 0)
        {
          thread_count++;
        }
    }

  for (i = 0; i < 2 && ret >= 0; i++)
    {
      ret = bk7258_rpmsg_test_spawn(
              &threads[thread_count], i, BK7258_RPMSG_TEST_WORKER_PRIO,
              bk7258_rpmsg_test_worker, (FAR void *)(uintptr_t)i,
              &spawn_stage);
      if (ret >= 0)
        {
          thread_count++;
        }
    }

  if (ret >= 0)
    {
      ret = bk7258_rpmsg_test_spawn(
              &threads[thread_count], 0, BK7258_RPMSG_TEST_LOAD_PRIO,
              bk7258_rpmsg_test_load_worker, NULL, &spawn_stage);
      if (ret >= 0)
        {
          thread_count++;
        }
    }

  if (ret >= 0)
    {
      ret = bk7258_rpmsg_test_spawn(
              &threads[thread_count], 0,
              BK7258_RPMSG_TEST_CONTROLLER_PRIO,
              bk7258_rpmsg_test_controller_thread, NULL, &spawn_stage);
      if (ret >= 0)
        {
          thread_count++;
        }
    }
#else
  /* In the official SDK split the CP owns AON RTC initialization and the AP
   * reads the resulting shared counter.  Retain that ownership here through
   * the public SDK API instead of duplicating its register sequence.
   */

  ret = bk_aon_rtc_driver_init();
  if (ret >= 0)
    {
      ret = bk7258_rpmsg_test_sem_init(&priv->report_sem);
      if (ret >= 0)
        {
          report_sem_initialized = true;
        }
    }
#endif

  if (ret >= 0)
    {
      ret = rpmsg_register_callback(priv,
                                    bk7258_rpmsg_test_device_created,
                                    bk7258_rpmsg_test_device_destroy,
#ifdef CONFIG_BK7258_AP_CORE
                                    NULL, NULL);
#else
                                    bk7258_rpmsg_test_ns_match,
                                    bk7258_rpmsg_test_ns_bind);
#endif
    }

  if (ret >= 0)
    {
      callback_registered = true;
    }

  if (ret < 0)
    {
#ifdef CONFIG_BK7258_AP_CORE
      size_t cleanup;

      if (callback_registered)
        {
          rpmsg_unregister_callback(priv,
                                    bk7258_rpmsg_test_device_created,
                                    bk7258_rpmsg_test_device_destroy,
                                    NULL, NULL);
        }

      /* No test request can be accepted before callback registration.  Wake
       * every permanent worker, let it observe shutdown, then join in reverse
       * creation order before destroying any semaphore it may touch.
       */

      __atomic_store_n(&priv->shutdown, true, __ATOMIC_RELEASE);
      __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
      __atomic_store_n(&priv->load_stop, true, __ATOMIC_RELEASE);
      if (thread_count != 0)
        {
          /* Threads are created only after all semaphores exist.  Do not
           * touch a partially initialized semaphore array when semaphore
           * creation itself was the failing stage.
           */

          (void)nxsem_post(&priv->start_sem);
          (void)nxsem_post(&priv->worker_start_sem[0]);
          __atomic_fetch_add(&priv->worker_dispatch[1], 1u,
                             __ATOMIC_RELEASE);
          (void)nxsem_post(&priv->load_start_sem);
          (void)nxsem_post(&priv->tx_sem);
          __asm volatile ("dmb sy; sev" ::: "memory");
        }

      for (cleanup = thread_count; cleanup > 0; cleanup--)
        {
          (void)pthread_join(threads[cleanup - 1], NULL);
        }

