open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rpmsg_test.c
      while (semaphore_count > 0)
        {
          semaphore_count--;
          (void)nxsem_destroy(semaphores[semaphore_count]);
        }
#else
      if (callback_registered)
        {
          rpmsg_unregister_callback(priv,
                                    bk7258_rpmsg_test_device_created,
                                    bk7258_rpmsg_test_device_destroy,
                                    bk7258_rpmsg_test_ns_match,
                                    bk7258_rpmsg_test_ns_bind);
        }

      if (report_sem_initialized)
        {
          (void)nxsem_destroy(&priv->report_sem);
        }
#endif

      memset(&priv->ept, 0, sizeof(priv->ept));
      __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
      priv->connection_error = ret;
#ifdef CONFIG_BK7258_AP_CORE
      bk7258_rpmsg_test_reset_runtime(priv);
#endif
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
    }

  return ret;
}

#ifndef CONFIG_BK7258_AP_CORE
int bk7258_rpmsg_test_run(uint32_t count, uint32_t payload_size,
                          uint32_t flags, uint32_t timeout_ms,
                          struct bk7258_rpmsg_test_result_s *result)
{
  struct bk7258_rpmsg_test_dev_s *priv = &g_bk7258_rpmsg_test;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  struct bk7258_rpmsg_test_wire_s msg;
  clock_t start;
  int ret;

  if (result == NULL || count == 0 ||
      count > BK7258_RPMSG_TEST_MAX_COUNT || payload_size == 0 ||
      payload_size > BK7258_RPMSG_TEST_MAX_PAYLOAD ||
      (flags & ~BK7258_RPMSG_TEST_VALID_FLAGS) != 0 ||
      timeout_ms < BK7258_RPMSG_TEST_MIN_TIMEOUT ||
      timeout_ms > BK7258_RPMSG_TEST_MAX_TIMEOUT)
    {
      return -EINVAL;
    }

  memset(result, 0, sizeof(*result));
  ret = nxmutex_lock(&g_bk7258_rpmsg_test_lock);
  if (ret < 0)
    {
      return ret;
    }

  start = clock_systime_ticks();
  while (!bk7258_rpmsg_test_endpoint_ready() &&
         (clock_systime_ticks() - start) < MSEC2TICK(3000))
    {
      nxsig_usleep(1000);
    }

  if (!bk7258_rpmsg_test_endpoint_ready())
    {
      ret = priv->connection_error < 0 ?
            priv->connection_error : -ENOTCONN;
      goto out;
    }

  bk7258_rpmsg_test_flush_sem(&priv->report_sem);
  if (++g_bk7258_rpmsg_test_next_run == 0)
    {
      g_bk7258_rpmsg_test_next_run++;
    }

  priv->waiting_generation = control->generation;
  priv->waiting_run_id = g_bk7258_rpmsg_test_next_run;
  priv->report_valid = false;
  priv->connection_error = OK;
  memset(&priv->report, 0, sizeof(priv->report));

  memset(&msg, 0, BK7258_RPMSG_TEST_WIRE_HEADER_SIZE);
  msg.magic = BK7258_RPMSG_TEST_WIRE_MAGIC;
  msg.version = BK7258_RPMSG_TEST_WIRE_VERSION;
  msg.command = BK7258_RPMSG_TEST_COMMAND_START;
  msg.generation = priv->waiting_generation;
  msg.run_id = priv->waiting_run_id;
  msg.sequence = count;
  msg.slot = flags;
  msg.payload_size = payload_size;
  msg.value = timeout_ms;

  ret = bk7258_rpmsg_test_send_bounded(
          &msg, BK7258_RPMSG_TEST_WIRE_HEADER_SIZE,
          BK7258_RPMSG_TEST_SEND_TIMEOUT);
  if (ret < 0)
    {
      goto out;
    }

  ret = nxsem_tickwait_uninterruptible(&priv->report_sem,
                                        MSEC2TICK(timeout_ms));
  if (ret < 0)
    {
      goto out;
    }

  __asm volatile ("dmb sy" ::: "memory");
  if (!priv->report_valid)
    {
      ret = priv->connection_error < 0 ?
            priv->connection_error : -EPROTO;
      goto out;
    }

  memcpy(result, &priv->report, sizeof(*result));
  if (result->magic != BK7258_RPMSG_TEST_RESULT_MAGIC ||
      result->version != BK7258_RPMSG_TEST_RESULT_VERSION ||
      result->size != sizeof(*result) ||
      result->generation != priv->waiting_generation ||
      result->run_id != priv->waiting_run_id)
    {
      ret = -EPROTO;
      goto out;
    }

  ret = result->status;

out:
  nxmutex_unlock(&g_bk7258_rpmsg_test_lock);
  return ret;
}
#endif

#endif /* CONFIG_BK7258_RPMSG_TEST */
